---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ColorWithTransparency)
source: html/73ad46f5-f5cf-44c3-af15-2e4e3e194070.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.#ctor Method

Constructs the vertex from a point, a normal vector, and a color.

## Syntax (C#)
```csharp
public VertexPositionNormalColored(
	XYZ position,
	XYZ normal,
	ColorWithTransparency color
)
```

## Parameters
- **position** (`Autodesk.Revit.DB.XYZ`) - The vertex's position.
- **normal** (`Autodesk.Revit.DB.XYZ`) - The vertex's normal vector.
- **color** (`Autodesk.Revit.DB.ColorWithTransparency`) - The vertex's color.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null